print("""* 1 — тестти баштоо.
* 2 — тесттин эрежелерин көрсөтүү.
* 0 — программадан чыгуу.
* Башка сан же туура эмес символ киргизилсе, ката жөнүндө билдирүү чыгаруу.""")
while True:
    user = int(input(": "))
    if user == 1:
        score = 0
        print("""Question 1:
        Python'до экранга маалымат чыгаруу үчүн
        кайсы команда колдонулат?
        A. input()
        B. print()
        C. int()
        D. type()""")

        user_1 = input("Ваш ответ: ")

        if user_1 == "B":
            print("Правильный ответ!")
            score += 1
        else:
            print("Неправильный ответ!")

        print("""Question 2:
        Python'до колдонуучудан маалымат алуу үчүн
        кайсы команда колдонулат?
        A. print()
        B. str()
        C. input()
        D. type()""")

        user_2 = input("Ваш ответ: ")

        if user_2 == "C":
            print("Правильный ответ!")
            score += 1
        else:
            print("Неправильный ответ!")

        print("""Question 3:
        Python'до шарт текшерүү үчүн кайсы сөз колдонулат?
        A. for
        B. def
        C. while
        D. if""")

        user_3 = input("Ваш ответ: ")
        if user_3 == "D":
            print("Правильный ответ!")
            score += 1
        else:
            print("Неправильный ответ!")
        print(f"Ваш результат: {score}/3")
        print(f"Туура жооптор {score}")
        print(f"Жалпы суроолор: 3")
        print(f"Натыйжа: {35 * score}")
    if user == 2:
        print("""
        ===== ТЕСТТИН ЭРЕЖЕЛЕРИ =====

        1. Тестте 3 суроо бар.
        2. Ар бир суроодо A, B, C, D деген 4 жооп бар.
        3. Ар бир суроого бир гана жооп тандаңыз.
        4. Туура жооп үчүн 1 упай берилет.
        5. Туура эмес жооп үчүн упай берилбейт.
        6. Жоопту чоң тамга менен жазыңыз (A, B, C же D).
        7. Тесттин аягында жалпы упай көрсөтүлөт.

        Ийгилик!
        ============================
        """)
    if user == 0:
        print("Саламатта калыныз!")
        break



